## 🚀 Terragrunt Apply Completed

**Project**: claude-code-action
**Environment**: `develop`
**Directory**: `platform/claude-code-action/terragrunt/envs/develop`
**Status**: ✅ Success
**Action**: apply

<details>
<summary>📝 Apply Output</summary>

```hcl
13:23:11.442 INFO   Downloading Terraform configurations from ../../modules into ./.terragrunt-cache/3vZGMpqoKLLsbtKI4YcBPq08Zt8/Zk7HeCSA_UUJemped2ZYXcxqU8Y
13:23:12.492 INFO   terraform: Initializing the backend...
13:23:13.832 INFO   terraform: 
13:23:13.832 INFO   terraform: Successfully configured the backend "s3"! Terraform will automatically
13:23:13.832 INFO   terraform: use this backend unless the backend configuration changes.
13:23:14.683 INFO   terraform: Initializing provider plugins...
13:23:14.683 INFO   terraform: - Finding hashicorp/aws versions matching "~> 5.0"...
13:23:14.854 INFO   terraform: - Finding hashicorp/tls versions matching "~> 4.0"...
13:23:14.966 INFO   terraform: - Installing hashicorp/aws v5.100.0...
13:23:18.833 INFO   terraform: - Installed hashicorp/aws v5.100.0 (signed by HashiCorp)
13:23:18.913 INFO   terraform: - Installing hashicorp/tls v4.1.0...
13:23:19.103 INFO   terraform: - Installed hashicorp/tls v4.1.0 (signed by HashiCorp)
13:23:19.103 INFO   terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
13:23:19.104 INFO   terraform: selections it made above. Include this file in your version control repository
13:23:19.104 INFO   terraform: so that Terraform can guarantee to make the same selections by default when
13:23:19.104 INFO   terraform: you run "terraform init" in the future.
13:23:19.104 INFO   terraform: Terraform has been successfully initialized!
13:23:21.354 STDOUT terraform: Acquiring state lock. This may take a few moments...
13:23:23.880 STDOUT terraform: data.aws_caller_identity.current: Reading...
13:23:24.029 STDOUT terraform: data.aws_caller_identity.current: Read complete after 0s [id=559744160976]
13:23:24.152 STDOUT terraform: Terraform used the selected providers to generate the following execution
13:23:24.152 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
13:23:24.152 STDOUT terraform:   + create
13:23:24.153 STDOUT terraform: Terraform will perform the following actions:
13:23:24.153 STDOUT terraform:   # aws_iam_policy.bedrock_claude_policy will be created
13:23:24.153 STDOUT terraform:   + resource "aws_iam_policy" "bedrock_claude_policy" {
13:23:24.153 STDOUT terraform:       + arn              = (known after apply)
13:23:24.153 STDOUT terraform:       + attachment_count = (known after apply)
13:23:24.153 STDOUT terraform:       + description      = "Policy for Claude Code Action to access Amazon Bedrock Claude models"
13:23:24.153 STDOUT terraform:       + id               = (known after apply)
13:23:24.154 STDOUT terraform:       + name             = "claude-code-action-monorepo-bedrock-claude-policy"
13:23:24.154 STDOUT terraform:       + name_prefix      = (known after apply)
13:23:24.154 STDOUT terraform:       + path             = "/"
13:23:24.154 STDOUT terraform:       + policy           = jsonencode(
13:23:24.154 STDOUT terraform:             {
13:23:24.154 STDOUT terraform:               + Statement = [
13:23:24.154 STDOUT terraform:                   + {
13:23:24.154 STDOUT terraform:                       + Action   = [
13:23:24.155 STDOUT terraform:                           + "bedrock:InvokeModel",
13:23:24.155 STDOUT terraform:                           + "bedrock:InvokeModelWithResponseStream",
13:23:24.155 STDOUT terraform:                         ]
13:23:24.155 STDOUT terraform:                       + Effect   = "Allow"
13:23:24.155 STDOUT terraform:                       + Resource = "*"
13:23:24.155 STDOUT terraform:                     },
13:23:24.155 STDOUT terraform:                   + {
13:23:24.155 STDOUT terraform:                       + Action   = [
13:23:24.155 STDOUT terraform:                           + "bedrock:ListFoundationModels",
13:23:24.155 STDOUT terraform:                           + "bedrock:GetFoundationModel",
13:23:24.155 STDOUT terraform:                         ]
13:23:24.155 STDOUT terraform:                       + Effect   = "Allow"
13:23:24.155 STDOUT terraform:                       + Resource = "*"
13:23:24.156 STDOUT terraform:                     },
13:23:24.156 STDOUT terraform:                 ]
13:23:24.156 STDOUT terraform:               + Version   = "2012-10-17"
13:23:24.156 STDOUT terraform:             }
13:23:24.156 STDOUT terraform:         )
13:23:24.156 STDOUT terraform:       + policy_id        = (known after apply)
13:23:24.156 STDOUT terraform:       + tags             = {
13:23:24.156 STDOUT terraform:           + "CostCenter"  = "engineering"
13:23:24.156 STDOUT terraform:           + "Environment" = "monorepo"
13:23:24.156 STDOUT terraform:           + "ManagedBy"   = "terragrunt"
13:23:24.156 STDOUT terraform:           + "Name"        = "claude-code-action-monorepo-bedrock-claude-policy"
13:23:24.157 STDOUT terraform:           + "Owner"       = "panicboat"
13:23:24.157 STDOUT terraform:           + "Project"     = "claude-code-action"
13:23:24.157 STDOUT terraform:           + "Purpose"     = "bedrock-claude-access"
13:23:24.157 STDOUT terraform:           + "Repository"  = "panicboat/monorepo"
13:23:24.157 STDOUT terraform:         }
13:23:24.157 STDOUT terraform:       + tags_all         = {
13:23:24.157 STDOUT terraform:           + "CostCenter"  = "engineering"
13:23:24.157 STDOUT terraform:           + "Environment" = "monorepo"
13:23:24.158 STDOUT terraform:           + "ManagedBy"   = "terragrunt"
13:23:24.158 STDOUT terraform:           + "Name"        = "claude-code-action-monorepo-bedrock-claude-policy"
13:23:24.158 STDOUT terraform:           + "Owner"       = "panicboat"
13:23:24.158 STDOUT terraform:           + "Project"     = "claude-code-action"
13:23:24.158 STDOUT terraform:           + "Purpose"     = "bedrock-claude-access"
13:23:24.158 STDOUT terraform:           + "Repository"  = "panicboat/monorepo"
13:23:24.159 STDOUT terraform:         }
13:23:24.159 STDOUT terraform:     }
13:23:24.159 STDOUT terraform:   # aws_iam_role.claude_code_action_role will be created
13:23:24.159 STDOUT terraform:   + resource "aws_iam_role" "claude_code_action_role" {
13:23:24.159 STDOUT terraform:       + arn                   = (known after apply)
13:23:24.159 STDOUT terraform:       + assume_role_policy    = jsonencode(
13:23:24.159 STDOUT terraform:             {
13:23:24.159 STDOUT terraform:               + Statement = [
13:23:24.159 STDOUT terraform:                   + {
13:23:24.159 STDOUT terraform:                       + Action    = "sts:AssumeRoleWithWebIdentity"
13:23:24.159 STDOUT terraform:                       + Condition = {
13:23:24.159 STDOUT terraform:                           + StringEquals = {
13:23:24.159 STDOUT terraform:                               + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
13:23:24.159 STDOUT terraform:                             }
13:23:24.159 STDOUT terraform:                           + StringLike   = {
13:23:24.159 STDOUT terraform:                               + "token.actions.githubusercontent.com:sub" = "repo:panicboat/monorepo:*"
13:23:24.159 STDOUT terraform:                             }
13:23:24.159 STDOUT terraform:                         }
13:23:24.160 STDOUT terraform:                       + Effect    = "Allow"
13:23:24.160 STDOUT terraform:                       + Principal = {
13:23:24.160 STDOUT terraform:                           + Federated = "arn:aws:iam::559744160976:oidc-provider/token.actions.githubusercontent.com"
13:23:24.160 STDOUT terraform:                         }
13:23:24.160 STDOUT terraform:                     },
13:23:24.160 STDOUT terraform:                 ]
13:23:24.160 STDOUT terraform:               + Version   = "2012-10-17"
13:23:24.160 STDOUT terraform:             }
13:23:24.160 STDOUT terraform:         )
13:23:24.160 STDOUT terraform:       + create_date           = (known after apply)
13:23:24.160 STDOUT terraform:       + force_detach_policies = false
13:23:24.160 STDOUT terraform:       + id                    = (known after apply)
13:23:24.160 STDOUT terraform:       + managed_policy_arns   = (known after apply)
13:23:24.161 STDOUT terraform:       + max_session_duration  = 7200
13:23:24.161 STDOUT terraform:       + name                  = "claude-code-action-monorepo-github-actions-role"
13:23:24.161 STDOUT terraform:       + name_prefix           = (known after apply)
13:23:24.161 STDOUT terraform:       + path                  = "/"
13:23:24.161 STDOUT terraform:       + tags                  = {
13:23:24.161 STDOUT terraform:           + "CostCenter"  = "engineering"
13:23:24.161 STDOUT terraform:           + "Environment" = "monorepo"
13:23:24.161 STDOUT terraform:           + "GitHubOrg"   = "panicboat"
13:23:24.161 STDOUT terraform:           + "GitHubRepo"  = "monorepo"
13:23:24.162 STDOUT terraform:           + "ManagedBy"   = "terragrunt"
13:23:24.162 STDOUT terraform:           + "Name"        = "claude-code-action-monorepo-github-actions-role"
13:23:24.162 STDOUT terraform:           + "Owner"       = "panicboat"
13:23:24.162 STDOUT terraform:           + "Project"     = "claude-code-action"
13:23:24.162 STDOUT terraform:           + "Purpose"     = "claude-code-action-bedrock"
13:23:24.162 STDOUT terraform:           + "Repository"  = "panicboat/monorepo"
13:23:24.162 STDOUT terraform:         }
13:23:24.162 STDOUT terraform:       + tags_all              = {
13:23:24.162 STDOUT terraform:           + "CostCenter"  = "engineering"
13:23:24.162 STDOUT terraform:           + "Environment" = "monorepo"
13:23:24.162 STDOUT terraform:           + "GitHubOrg"   = "panicboat"
13:23:24.162 STDOUT terraform:           + "GitHubRepo"  = "monorepo"
13:23:24.162 STDOUT terraform:           + "ManagedBy"   = "terragrunt"
13:23:24.163 STDOUT terraform:           + "Name"        = "claude-code-action-monorepo-github-actions-role"
13:23:24.163 STDOUT terraform:           + "Owner"       = "panicboat"
13:23:24.163 STDOUT terraform:           + "Project"     = "claude-code-action"
13:23:24.163 STDOUT terraform:           + "Purpose"     = "claude-code-action-bedrock"
13:23:24.163 STDOUT terraform:           + "Repository"  = "panicboat/monorepo"
13:23:24.163 STDOUT terraform:         }
13:23:24.163 STDOUT terraform:       + unique_id             = (known after apply)
13:23:24.163 STDOUT terraform:       + inline_policy (known after apply)
13:23:24.164 STDOUT terraform:     }
13:23:24.164 STDOUT terraform:   # aws_iam_role_policy_attachment.bedrock_claude_policy_attachment will be created
13:23:24.164 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "bedrock_claude_policy_attachment" {
13:23:24.164 STDOUT terraform:       + id         = (known after apply)
13:23:24.164 STDOUT terraform:       + policy_arn = (known after apply)
13:23:24.164 STDOUT terraform:       + role       = "claude-code-action-monorepo-github-actions-role"
13:23:24.165 STDOUT terraform:     }
13:23:24.165 STDOUT terraform: Plan: 3 to add, 0 to change, 0 to destroy.
13:23:24.165 STDOUT terraform: 
13:23:24.165 STDOUT terraform: Changes to Outputs:
13:23:24.165 STDOUT terraform:   + bedrock_models               = [
13:23:24.165 STDOUT terraform:       + "anthropic.claude-3-7-sonnet-20250219-v1:0",
13:23:24.165 STDOUT terraform:     ]
13:23:24.166 STDOUT terraform:   + bedrock_policy_arn           = (known after apply)
13:23:24.166 STDOUT terraform:   + claude_model_region          = "us-west-2"
13:23:24.166 STDOUT terraform:   + github_actions_configuration = {
13:23:24.166 STDOUT terraform:       + aws_region          = "ap-northeast-1"
13:23:24.166 STDOUT terraform:       + bedrock_models      = [
13:23:24.166 STDOUT terraform:           + "anthropic.claude-3-7-sonnet-20250219-v1:0",
13:23:24.166 STDOUT terraform:         ]
13:23:24.166 STDOUT terraform:       + claude_model_region = "us-west-2"
13:23:24.166 STDOUT terraform:       + role_arn            = (known after apply)
13:23:24.167 STDOUT terraform:     }
13:23:24.167 STDOUT terraform:   + iam_role_arn                 = (known after apply)
13:23:24.167 STDOUT terraform:   + iam_role_name                = "claude-code-action-monorepo-github-actions-role"
13:23:25.034 STDOUT terraform: aws_iam_policy.bedrock_claude_policy: Creating...
13:23:25.035 STDOUT terraform: aws_iam_role.claude_code_action_role: Creating...
13:23:25.353 STDOUT terraform: aws_iam_policy.bedrock_claude_policy: Creation complete after 0s [id=arn:aws:iam::559744160976:policy/claude-code-action-monorepo-bedrock-claude-policy]
13:23:25.364 STDOUT terraform: aws_iam_role.claude_code_action_role: Creation complete after 0s [id=claude-code-action-monorepo-github-actions-role]
13:23:25.365 STDOUT terraform: aws_iam_role_policy_attachment.bedrock_claude_policy_attachment: Creating...
13:23:25.472 STDOUT terraform: aws_iam_role_policy_attachment.bedrock_claude_policy_attachment: Creation complete after 0s [id=claude-code-action-monorepo-github-actions-role-20250616132325430800000001]
13:23:26.569 STDOUT terraform: 
13:23:26.569 STDOUT terraform: Apply complete! Resources: 3 added, 0 changed, 0 destroyed.
13:23:26.569 STDOUT terraform: 
13:23:26.569 STDOUT terraform: Outputs:
13:23:26.569 STDOUT terraform: 
13:23:26.569 STDOUT terraform: bedrock_models = tolist([
13:23:26.569 STDOUT terraform:   "anthropic.claude-3-7-sonnet-20250219-v1:0",
13:23:26.569 STDOUT terraform: ])
13:23:26.569 STDOUT terraform: bedrock_policy_arn = "arn:aws:iam::559744160976:policy/claude-code-action-monorepo-bedrock-claude-policy"
13:23:26.569 STDOUT terraform: claude_model_region = "us-west-2"
13:23:26.569 STDOUT terraform: github_actions_configuration = {
13:23:26.569 STDOUT terraform:   "aws_region" = "ap-northeast-1"
13:23:26.570 STDOUT terraform:   "bedrock_models" = tolist([
13:23:26.570 STDOUT terraform:     "anthropic.claude-3-7-sonnet-20250219-v1:0",
13:23:26.570 STDOUT terraform:   ])
13:23:26.570 STDOUT terraform:   "claude_model_region" = "us-west-2"
13:23:26.570 STDOUT terraform:   "role_arn" = "arn:aws:iam::559744160976:role/claude-code-action-monorepo-github-actions-role"
13:23:26.570 STDOUT terraform: }
13:23:26.570 STDOUT terraform: iam_role_arn = "arn:aws:iam::559744160976:role/claude-code-action-monorepo-github-actions-role"
13:23:26.570 STDOUT terraform: iam_role_name = "claude-code-action-monorepo-github-actions-role"
```
</details>

[View full workflow logs](https://github.com/panicboat/monorepo/actions/runs/15682038850)
---
*Triggered by workflow automation system*
<!-- thollander/actions-comment-pull-request "terragrunt-apply-develop-claude-code-action" -->